app/controllers/blacks_controller.rb

  def index
    @blacks = Black.all
---
SELECT * FROM "blacks"

  def show
    @black = Black.find(params[:id])
---
SELECT * FROM "blacks" WHERE ("blacks"."id" = 1)

  def edit
    @black = Black.find(params[:id])
---
SELECT * FROM "blacks" WHERE ("blacks"."id" = 1)

  def create
    @black = Black.new(params[:black])
    if current_user?
      @black.user_id = current_user.id
    else
      @black.user_id = 0
    end

    respond_to do |format|
      if @black.save
---
INSERT INTO "blacks" ("boxofshit_file_size", "boxofshit_updated_at", "created_at", "updated_at", "user_id", "boxofshit_content_type", "description", "boxofshit_file_name") VALUES(1483785, '2010-02-28 20:52:10', '2010-02-28 20:52:10', '2010-02-28 20:52:10', 1, 'application/octet-stream', 'fff', 'JoseRisi_Front_Page')

  def update
    @black = Black.find(params[:id])
---
SELECT * FROM "blacks" WHERE ("blacks"."id" = 1)